<script setup>
  import { ref } from 'vue'
  const tabs = ref(['數學', '物理', '化學', '生物', '資訊', '地科'])
  const activeTab = ref('數學')
</script>

<template>
  <div class="categories_bg">
    <p>Hi! This is the Categories Page</p>
  </div>
  <br/>
  <div class="flex justify-start space-x-4">
    <div
      v-for="tab in tabs"
      :key="tab"
      @click="activeTab = tab"
      :class="[
        'py-2 px-4 font-medium text-gray-500 hover:text-blue-500 ',
        activeTab === tab ? 'text-blue-500' : ''
      ]"
    >
      {{ tab }}
    </div>
  </div>
  <div class="px-18 py-4">
    <!--
       各科的內容需要：
       1. 老師的介紹
       2. 老師的照片
       3. 作品列表（可能點進去跳出一個小視窗，介紹作品？）
    -->
    <div v-if="activeTab === '數學'">
      <p>指導教師：尤貴弘</p>
      <p>尤貴弘，字達，號董（有懂？），是個溫文儒雅的好老師，備受大家喜愛。身為數資班的老師，和其他老師不一樣的是，老師從來不誇耀自己的能力，不會說自己數學很厲害，甚至每當我們想要老師使用微積分的時候，他常常說：「可是我不會微積分啊」外表看似在裝弱，但我們每個人都知道老師其實很有料，基本上無論問他甚麼問題，他都能夠很清楚、很有條理地回答，直到學生了解為止，可以看出老師真的是一位很有耐心的人。此外，無論在教課或解題時，實在很佩服老師可以把思路講得這麼透徹，其實不一定每個老師都會把為甚麼這樣算的想法講出來，貴弘老師卻把這部分做的很紮實，怪不得物理老師總是把數學知識推給貴弘老師了。另外，老師他喜歡吃菠蘿麵包，有一次他在課堂上情不自禁拿出來吃，說道：「菠蘿麵包很好吃啊」使我們哄堂大笑，也發覺老師是一個很簡單就滿足的人，讓我們知道以後可以如何回（賄）報（賂）老師。</p>
    </div>
    <div v-if="activeTab === '物理'">
      <p>指導教師：柳順儒</p>
      <h3>上課</h3>
        <p>順儒老師作為兩班的物理老師，上課井然有序，從最一開始的觀念，到後來的每一個物理公式，老師都會非常用力的解釋過一次，作為老師，他一定會確定每個學生都有懂之後才繼續下去，而且老師的評分方式非常合理，雖然他出的考卷大概會有80%的同學不及格，但在最後仍然只有10%的同學被當掉，在此感謝順儒老師送我的分數。</p>

      <h3>學投資</h3>
        <p>除此之外，順儒老師還有另一個身分——校內多元選修「Python學投資」的授課老師，老師上課極為認真，選他這門課的學生都會有無比巨大的收穫。二年級開始，一週會有5節研究課，其中有2節排在星期五上午，時間太短了，不適合去實驗室作實驗，因此老師熱情邀約我們星期五這兩節課來跟他一起用 Python 學投資。我們每週要輪流看一部網路上用 Python 投資理財的影片，並將影片內容及範例程式碼講解給其他同學。平時輪到老師時，在教學上若有任何問題，最常和本組的朗神討論。在老師的帶領及同學的切磋下，本組同學在資訊領域也有長足(?)的進步，讓我們對於
          <ruby>
            預<rp>(</rp><rt>ㄆㄞ</rt><rp>)</rp>
            測<rp>(</rp><rt>ㄙㄣˇ</rt><rp>)</rp>
            股<rp>(</rp><rt>ㄩˇ</rt><rp>)</rp>
            市<rp>(</rp><rt>ㄈㄚˇ</rt><rp>)</rp>
          </ruby>
        走向有相當程度的認識。</p>

      <h3>專題課</h3>
        <p>學期初時，基於物理組可能的辛苦以及困難，專題課開始時才發現只有4人在物理組。一連串的努力後，老師終於帶領我們做了物理奧林匹亞初試的詳解、用Python學投資、以及提醒大家壓力不要太大，「高中專題做到哪裡就算哪裡」，儘管各位同學都做得非常完善，毫無缺漏，真是擁有大愛的老師啊。</p>

        <p>以下一些簡單的語助詞讓你瞬間變成物理老師:</p>
        <ol>
          <li>將語句中的"笨"換成"豬頭"</li>
          <li>驚訝的語助詞全部換成"哇靠"</li>
          <li>表示認同的時候"有懂"，膩了請改"了"</li>
          <li>打字的時候強調請用『』以及！</li>
          <li>表情符號請用饅頭人表符不要用小黃人，而且一定要一次三個</li>
          <li>讚嘆的時候：太~厲~害~了~</li>
          <li>把所有的"好"換成"OK"</li>
          <li>把"Tracker"念成"垂可"</li>
          <li>當你不想算小學數學時，"經過一番努力"就有答案了(偷看答案)</li>
        </ol>
    </div>
    <div v-if="activeTab === '化學'">
      <p>指導教師：楊傑超</p>
      <p>[TODO]: 之後去跟化學組要介紹</p>
    </div>
    <div v-if="activeTab === '生物'">
      <p>指導教師：朱芳琳</p>
      <p>關於 生物科 朱芳琳老師 的十大事跡</p> 
      <ol type="1">
        <li>【手打開開】 上課時常出現特有動作，如圖。</li>
        <li>【表單大王】 很不小心的出了很多表單，期末才會把分數加一加並發還考卷，如果期末的時候一直收到classroom的通知，那大概就是生物老師想起來要發還考卷了。</li>
        <li>【當人威脅】 聲稱如果看到小人在草原上奔跑就當掉。（某陣子班上一直玩糖豆人）</li>
        <li>【處變不驚】 即便有人上課站在椅子上，上課時都能夠開啟自我屏蔽功能，老師十分習慣我們站在桌子上課。</li>
        <li>【滿懷關愛】 非常支持學生專題課去吃拉麵，生物組每週堅持。</li>
        <li>【永不回頭】 只見到一次的Kahoot，從此就沒有再看到了，之後的每一堂課在26班都可以聽到程朗很堅持要玩Kahoot。</li>
        <li>【成就達成】 具有企圖心，成功比賴皮遲到更久，這個習慣在高二之後越來越明顯，期待老師以後的每堂課都可以準時到教室。</li>
        <li>【用功努力】 每學期都透過免修考費盡心思的搞死學生（出自檸檬，或許是因為他這學期沒過，才這麼怨恨，相較之下，其他人已經習慣了）</li>
        <li>【考卷魔王】 她擁有永遠出不完也寫不完的考卷。</li>
      </ol>

      <h3>#凌晨通知</h3>
      <p>在芳琳老師的世界中，沒有沒有來不及發的通知，只有來不及在上課前發的通知。曾經有好幾次上課前一天晚上的12.以後老師才在GC提醒同學們預習隔天要小考。</p>
      <p>什麼？你問有人10.睡覺怎麼辦？問就是放棄。</p>
      <h3>#手繪王者</h3>
      身為樹枝班的生物老師， 在教學時難免會需要透過繪製圖片來表達一些艱深的生物概念，此時芳琳老師高超的手繪技巧便派上用場。在老師的
      <ruby>
        鼓<rp>(</rp><rt>ㄒㄧㄝˊ</rt><rp>)</rp>
        勵<rp>(</rp><rt>ㄆㄛˋ</rt><rp>)</rp>
      </ruby>
      下，班上同學都不由自主的對這些儼然為世界頂尖藝術品的美及深刻的寓意由衷的發出讚嘆。
      #手打開開
      每次上課都積極使用手部動作活化教學，希望藉由這些肢體的輔助，展現對同學的關愛與熱情，讓學習更加生動有趣（他越是手打開開，同學們越不知道他在上什麼）
      #編審委員
      是翰林版生物課本的編審委員，所以只要發現課本寫的不好可以反應給老師知道，但會不會改就是另一回事了。

    </div>
    <div v-if="activeTab === '資訊'">
      <p>指導教師：王鼎中</p>
    </div>
    <div v-if="activeTab === '地科'">
      <p>指導教師：李文禮</p>
    </div>
  </div>
</template>

<style>
.categories_bg {
  width: w-full;
  height: fit-content;
  background-color: lightcoral;
  text-align: center;
}

.categories_bg p {
  color: darkslateblue;
  font-style: italic;
  font-size: xx-large;
}
.text-blue-500 {
  color: #22a7f0;
}
</style>
